GT2/GT2/URANS/KO_HRN/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //default     Euler;
    default 	backward;
    //default 	CrankNicolson 0.7;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;
    //grad(U)         Gauss linear;

    default          cellLimited Gauss linear 1;
    //grad(p)          cellLimited Gauss linear 0.5;
    //grad(U)          cellLimited Gauss linear 1;	//Dissipative
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwind grad(U);
    //div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss limitedLinearV 1;
    //div(phi,U)      Gauss upwind;

    div(phi,k)      	Gauss linearUpwind default; 
    div(phi,omega)  	Gauss linearUpwind default; 
    div(phi,nuTilda) 	Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
      default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
    //method Poisson;

    //Optional entry enabling the calculation of the normal-to-wall field
    //nRequired false;
}

// ************************************************************************* //
